added new screenshots and doc updates
